#+TITLE: Coding Design Principles including UML, SOLID Principles, and Design Patterns

I've been reading a lot recently about what is considered good versus bad coding design. This sometimes is also referred to as
/patterns/ and /anti-patterns/ respectively. What I've found is that it comes down to "our experience of things that made life easier".
On the contrary, it's also "things that made life terrible for us -- making trivial tasks harder than they actually should be". In some cases,
there may be some overlap i.e. what person A considers as a good pattern is considered an anti-pattern by person B. In such cases, it usually boils
down to what is the task at hand, what are the requirements, do I need a complicated data structure?, do I need a fancy pattern? etc. As always, in engineering,
it's a matter of taste as well.

Note that most of the principles are language agnostic.

Before getting started, here's a list of resources I found useful when compiling this document:
1) [[http://isocpp.github.io/CppCoreGuidelines/CppCoreGuidelines][C++ Core Guidelines]]
2) [[http://williamdurand.fr/2013/07/30/from-stupid-to-solid-code/][From STUPID to SOLID Code!]]
3) [[https://code.tutsplus.com/series/the-solid-principles--cms-634][The SOLID Principles]]
4) [[https://scotch.io/bar-talk/s-o-l-i-d-the-first-five-principles-of-object-oriented-design][SOLID -- Object Oriented Design]]
5) [[http://blog.gauffin.org/2012/05/solid-principles-with-real-world-examples/][SOLID Principles with real world examples]]
6) [[https://www.codeproject.com/Tips/1033646/SOLID-Principle-with-Csharp-Example][SOLID Principles with C# Examples]]

Note that I'll keep adding to this list as I discover more stuff.

One other thing that I learnt was that most problems in engineering can be solved by abstraction and indirection. Abstraction also involves
simplifying a complicated problem into smaller easily solved problems.

Enough talk, let's get to the coding now!

*** S - Single Responsibility Principle (SRP)
"Every class should have a single responsibility. There should never be more than one reason for a class to change."

Let's look at an example:

#+BEGIN_SRC C++ :exports both
#include <iostream>
#include <vector>

class Shape {
  public:
    virtual ~Shape() = 0;
};

Shape::~Shape() {}

class Circle : public Shape {
  public:
    Circle(int r)
        : radius(r) {}
    int get_radius() const {
        return radius;
    }

  private:
    int radius;
};

class Square : public Shape {
  public:
    Square(int l)
        : length(l) {}
    int get_length() const {
        return length;
    }

  private:
    int length;
};

class AreaCalculator {
  public:
    AreaCalculator(const std::vector<Shape*>& v)
        : shapes(v) {}
    int sum() {
        return 1234; // some logic to calculate sum based on shapes
    }
    void output() {
        std::cout << "The sum is: " << sum() << std::endl;
    }

  private:
    std::vector<Shape*> shapes;
};

int main() {
    Circle c(5);
    Square s(10);
    AreaCalculator calc({&c, &s});
    calc.output();
    return 0;
}

#+END_SRC

#+RESULTS:
: The sum is: 1234

Here, we can see that =AreaCalculator= can calculate the sum of its shapes AND also output the sum.

Now what if instead of outputting to stdout, we want to serialize this to a JSON file? 

Here, SRP is broken because =AreaCalculator= will have to be changed either if we decide to change the sum logic, or if we decide to
change the output format. Instead, we can do something like this:

#+BEGIN_SRC C++ :exports both
#include <iostream>
#include <vector>

class Shape {
  public:
    virtual ~Shape() = 0;
};

Shape::~Shape() {}

class Circle : public Shape {
  public:
    Circle(int r)
        : radius(r) {}
    int get_radius() const {
        return radius;
    }

  private:
    int radius;
};

class Square : public Shape {
  public:
    Square(int l)
        : length(l) {}
    int get_length() const {
        return length;
    }

  private:
    int length;
};

class AreaCalculator {
  public:
    AreaCalculator(const std::vector<Shape*>& v)
        : shapes(v) {}
    int sum() const {
        return 1234; // some logic to calculate sum based on shapes
    }

  private:
    std::vector<Shape*> shapes;
};

class AreaOutputter {
  public:
    AreaOutputter(const AreaCalculator& a)
        : calc(a) {}
    void output1() {
        std::cout << "The sum is: " << calc.sum() << std::endl;
    }
    void output2() {
        std::cout << "Another way of outputting sum is: " << calc.sum()
                  << std::endl;
    }

  private:
    const AreaCalculator& calc;
};

int main() {
    Circle c(5);
    Square s(10);
    AreaCalculator calc({&c, &s});
    AreaOutputter outputter(calc);
    outputter.output2();
    return 0;
}
#+END_SRC

#+RESULTS:
: Another way of outputting sum is: 1234

Note that although we discussed classes here, SRP can be applied to functions as well i.e. functions should only have one reason to change.

*** Singleton (C)
Ensure a class only has one instance and provide a global point of access to it.
#+BEGIN_SRC C++ :exports both
#include <iostream>
#include <memory>

using namespace std;

class MySingleton {
  public:
    static shared_ptr<MySingleton> get_instance() {
        if (!instance)
            instance =
                shared_ptr<MySingleton>(new MySingleton());
        return instance;
    }

    void foo() {
        cout << "calling foo..\n";
    }

  private:
    MySingleton(){};
    static shared_ptr<MySingleton> instance;
};

shared_ptr<MySingleton> MySingleton::instance = nullptr;

int main() {
    auto my_singleton_obj = MySingleton::get_instance();
    my_singleton_obj->foo();
    return 0;
}
#+END_SRC

#+RESULTS:
: calling foo..

Great. But what if we are in a multi-threaded environment? How do we ensure that all threads get only a
single instance of the class? Here's one way using C++11:

#+BEGIN_SRC C++ :exports both
#include <iostream>
#include <memory>
#include <mutex>

#include <mutex>

using namespace std;

class MySingleton {
  public:
    static void get_instance_helper() {
        if (!instance) {
            instance =
                shared_ptr<MySingleton>(new MySingleton());
        }
    }

    static shared_ptr<MySingleton> get_instance() {
        call_once(singleton_flag, get_instance_helper);
        return instance;
    }

    void foo() {
        cout << "calling foo..\n";
    }

  private:
    MySingleton(){};
    static once_flag singleton_flag;
    static shared_ptr<MySingleton> instance;
};

once_flag MySingleton::singleton_flag;
shared_ptr<MySingleton> MySingleton::instance = nullptr;

int main() {
    auto my_singleton_obj = MySingleton::get_instance();
    my_singleton_obj->foo();
    return 0;
}
#+END_SRC

#+RESULTS:
: calling foo..

Previously calls to =get_instance= weren't synchronized, but now they are and therefore =get_instance= is thread safe.
The code is also exception safe i.e. it will be behave as expected if get_instance throws an exception.

Another approach is:

#+BEGIN_SRC C++ :exports both
static Singleton* getSingletonInstance()
{
    static Singleton instance;
    return &instance;
}
#+END_SRC

In C++11, the above is guaranteed to perform thread-safe initialisation.

Before C++11, the typical way to solve this issue was [[http://preshing.com/20130930/double-checked-locking-is-fixed-in-cpp11/][double-checked locking]].

*** Strategy (B)
Strategy defines a family of algorithms, encapsulating each one, and making them interchangeable. It lets the algorithm vary independently from
clients that use it and that too at run-time.

#+BEGIN_SRC C++ :exports both
#include <iostream>
#include <memory>

using namespace std;

class Sort {
  public:
    virtual void sort() const = 0;
};

class CountingSort : public Sort {
  public:
    void sort() const override {
        cout << "Performing counting sort...\n";
    }
};

class HeapSort : public Sort {
    void sort() const override {
        cout << "Performing heap sort...\n";
    }
};

class MergeSort : public Sort {
    void sort() const override {
        cout << "Performing merge sort...\n";
    }
};

/// Fancy algorithm which uses sort as part of the algorithm
/// It can switch sorting technique at runtime
class FancyAlgorithm {
  public:
    FancyAlgorithm(Sort* sort)
        : m_sort(unique_ptr<Sort>(sort)) {}

    void run() const {
        cout << "Running algorithm...\n";
        m_sort->sort();
    }

  private:
    const unique_ptr<Sort> m_sort;
};

int main() {
    FancyAlgorithm algo(new CountingSort());
    algo.run();
    return 0;
}
#+END_SRC

#+RESULTS:
| Running    | algorithm... |         |
| Performing | counting     | sort... |

*** Observer (B)
The observer pattern is used to allow an object to publish/broadcast/push changes to its
state. Other objects subscribe to be immediately notified of any changes.

Note that we can have a middle layer which manages memory of the
app (subject) and devices (observers). Currently, we populate everything
on the stack and main() function "owns" that memory. 

#+BEGIN_SRC C++ :exports both
#include <iostream>
#include <memory>
#include <vector>

using namespace std;

class Device {
  public:
    virtual void update() = 0;
    virtual ~Device() {}
};

class IPhone : public Device {
  public:
    void update() override {
        cout << "Updating iPhone...\n";
    }
};

class IPad : public Device {
  public:
    void update() override {
        cout << "Updating iPad...\n";
    }
};

class AndroidPhone : public Device {
  public:
    void update() override {
        cout << "Updating android phone...\n";
    }
};

class App {
  public:
    /// subscribe === attach === register
    virtual void subscribe(Device&) = 0;
    /// unsubscribe === detach === unregister
    virtual void unsubscribe(Device&) = 0;
    /// push === notify
    virtual void push() = 0;
    virtual ~App() {}
};

class FancyApp : public App {
  public:
    FancyApp()
        : m_subscribed_devices() {}
    void subscribe(Device& device) override {
        m_subscribed_devices.push_back(&device);
    }
    void unsubscribe(Device& device) override {
        /// since order of devices in the vector doesn't
        /// matter for this application, we can use a simple
        /// O(1) remove from vector technique IF we know
        /// the index in the vector. After that, we can swap
        /// item at index with the last element and then
        /// delete last element. Not doing it now though
        /// since we don't store indices.
        for (auto it = m_subscribed_devices.begin();
             it != m_subscribed_devices.end();)
            if (*it == &device)
                it = m_subscribed_devices.erase(it);
            else
                ++it;
    }
    void push() override {
        for (auto device : m_subscribed_devices)
            device->update();
    }

  private:
    vector<Device*> m_subscribed_devices = {};
};

int main() {
    FancyApp app;
    IPhone iphone;
    IPad ipad;
    AndroidPhone android_phone;

    app.subscribe(iphone);
    app.subscribe(ipad);
    app.subscribe(android_phone);

    cout << "First push\n";
    app.push();
    cout << "\n";

    app.unsubscribe(ipad);
    cout << "Second push\n";
    app.push();

    return 0;
}
#+END_SRC

#+RESULTS:
| First    | push      |          |
| Updating | iPhone... |          |
| Updating | iPad...   |          |
| Updating | android   | phone... |
|          |           |          |
| Second   | push      |          |
| Updating | iPhone... |          |
| Updating | android   | phone... |

Note that:
- Currently, push is one-way i.e. from app (subject) to devices (observers)
  - Typically, in observer pattern, the observer has a reference back to the subject. That is because of 2-way communication when oberver's =update()= function gets the state from the subject, thereby forcing the need of subject.
  - In the example above, we are just printing stuff so don't need the subject's state.

*** Factory Method (C)
Define an interface for creating an object, but let subclasses decide which class to instantiate. Factory Method lets a class defer instantiation to subclasses.
Also the determination of what object to create can be made at run-time due to polymorphic type interface.

#+BEGIN_SRC C++ :exports both
#include <cassert>
#include <iostream>
#include <memory>
#include <vector>

using namespace std;

class Type {
  public:
    virtual ~Type(){};
    virtual void print() const = 0;
};

class IntegerType : public Type {
  public:
    void print() const override {
        cout << "I am an integer type\n";
    }
};

class StringType : public Type {
  public:
    void print() const override {
        cout << "I am a string type\n";
    }
};

class EnumType : public Type {
  public:
    void print() const override {
        cout << "I am an enum type\n";
    }
};

enum class TypeKind { INTEGER, STRING, ENUM };

class TypeFactory {
  public:
    virtual ~TypeFactory() {}
    virtual unique_ptr<Type> make_type(TypeKind) const = 0;
};

class MyHWTypeFactory : public TypeFactory {
  public:
    /// as we can see in the function implementation,
    /// we need to know the concrete type in order to
    /// create it; that's why we have a dotted arrow
    /// (depends on or uses but doesn't have a reference)
    /// from concrete type factory to concrete object being
    /// created in the UML.
    unique_ptr<Type>
    make_type(const TypeKind type_kind) const override {
        switch (type_kind) {
            case TypeKind::INTEGER:
                return make_unique<IntegerType>();
            case TypeKind::STRING:
                return make_unique<StringType>();
            case TypeKind::ENUM:
                return make_unique<EnumType>();
            default:
                assert(false);
        }
    }
};

int main() {
    MyHWTypeFactory tfac;
    auto t1 = tfac.make_type(TypeKind::STRING);
    t1->print();
    auto t2 = tfac.make_type(TypeKind::ENUM);
    t2->print();
    auto t3 = tfac.make_type(TypeKind::INTEGER);
    t3->print();

    return 0;
}
#+END_SRC

#+RESULTS:
| I | am | a  | string  | type |
| I | am | an | enum    | type |
| I | am | an | integer | type |

In this implementation, we always create a brand /new/ type object.
Instead, if needed, we can have a =getOrMake= type method which
only creates a new object if one doesn't exists, else returns the old
one. This can be good (depending on requirements)  because all clients going through 
the factory will then have access to one type and hence clients wont
have duplicate copies lying around.



